БухЭксп/Catalogs/CW_ОбщиеШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбщиеШаблоныДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКолонтитулов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКолонтитулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбщиеШаблоныДокументов/Forms/ФормаРедактированияШаблонаMXL/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CW_ШаблоныДокументовСерверВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	РедактированиеМакросовДоступно 	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.НазначениеШаблона.ЗначениеПустойСсылки, Объект.НазначениеШаблона); 

	Элементы.ПараметрыШаблонаИзменить.Видимость = РедактированиеМакросовДоступно;
	Элементы.ПараметрыШаблонаКонтекстноеМенюИзменить.Видимость = РедактированиеМакросовДоступно;
	
	УстановитьДоступностьЭлементовФормы();
	УстановитьОтборСпискаПараметровШаблона();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаНаШаблон = Объект.Ссылка;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		СсылкаНаШаблон = Параметры.ЗначениеКопирования;
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(СсылкаНаШаблон) Тогда
		ТабличныйДокумент = Справочники.CW_ОбщиеШаблоныДокументов.ДанныеШаблонаДокумента(СсылкаНаШаблон);
	КонецЕсли;   
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ИсходныеПечать  = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИсходныеРазмерыКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации");  
		ИсходныеПодпись = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИсходныеРазмерыКартинкиXML(ТабличныйДокумент, "РуководительПодпись");
		
		ИсходныеПечатьШиринаВысота   = Новый ФиксированнаяСтруктура(ИсходныеПечать); 
		ИсходныеПодписьШиринаВысота  = Новый ФиксированнаяСтруктура(ИсходныеПодпись);
	КонецЕсли;   
	
  	ЕстьПодписьИлиПечать = ПровериьНаличиеПодписиИлиПечать();
	УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать);
	
	//Настройки колонтитулов  
	Если Объект.ВыводитьКолонтитулы Тогда
		ТекущийОбъект 				= РеквизитФормыВЗначение("Объект");
		СвойстваКолонтитулов 		= ТекущийОбъект.НастройкиКолонтитулов.Получить();
		АдресНастроекКолонтитулов 	= ПоместитьВоВременноеХранилище(СвойстваКолонтитулов, УникальныйИдентификатор);

		СброситьКолонтитулыНаСервере();
		УстановитьКолонтитулыНаСервере(СвойстваКолонтитулов);
	КонецЕсли;
	
	УстановитьВидимостьНастроекКолонтитула();
	//Настройки колонтитулов

КонецПроцедуры   

&НаСервере
Функция ПровериьНаличиеПодписиИлиПечать()
	
	ЕстьПодписьИлиПечать = Ложь;
	
	Если ТабличныйДокумент.Рисунки.Количество() > 0 Тогда 
		ИменаРисунков = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИменаРисунков();
		Для Каждого ИмяРисунка из ИменаРисунков Цикл
			Рисунок = CW_ШаблоныДокументовСерверВызовСервера.СуществуетКартикаМакета(ТабличныйДокумент,ИмяРисунка); 
			Если Рисунок <> Неопределено Тогда
				ЕстьПодписьИлиПечать = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьПодписьИлиПечать;
	
КонецФункции 

&НаСервере
Процедура УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать)

	Элементы.ГруппаМасштаб.Видимость = ЕстьПодписьИлиПечать;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы() 
	
	РедактированиеДоступно = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, Объект.НазначениеШаблона);

	ТолькоПросмотр = Не РедактированиеДоступно; 
	
	Элементы.ПараметрыШаблона.Доступность  					= РедактированиеДоступно;
	Элементы.ТабличныйДокумент.Доступность 					= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаИзменитьПараметр.Доступность 	= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаДобавитьПараметр.Доступность 	= РедактированиеДоступно;
	Элементы.ФормаЭкспортМакета.Доступность 				= РедактированиеДоступно;
 	Элементы.ФормаИмпортМакета.Доступность 					= РедактированиеДоступно;
	Элементы.Комментарий.Доступность 						= РедактированиеДоступно;
	Элементы.ГруппаПараметры.Видимость 						= РедактированиеДоступно;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));

	//Настройки колонтитулов
	СвойстваКолонтитулов = Неопределено;
	Если Объект.ВыводитьКолонтитулы 
		И ЭтоАдресВременногоХранилища(АдресНастроекКолонтитулов) Тогда
		СвойстваКолонтитулов = ПолучитьИзВременногоХранилища(АдресНастроекКолонтитулов);
	КонецЕсли;
	
	ТекущийОбъект.НастройкиКолонтитулов = Новый ХранилищеЗначения(СвойстваКолонтитулов);
	//Настройки колонтитулов
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ВыбраннаяСтрока); 
	
	ВставитьПараметр(ИдентификаторПараметра);

КонецПроцедуры 

&НаКлиенте
Процедура ВставитьПараметр(Значение)  
	Модифицированность = Истина;
	
	мИменаРисунков = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИменаМакросовРисунков();
	Если мИменаРисунков.Найти(Значение) <> Неопределено Тогда   
		ИмяКартинки = СтрЗаменить(Значение,"[","");
		ИмяКартинки = СтрЗаменить(ИмяКартинки,"]","");
		
		Рисунок = CW_ШаблоныДокументовКлиент.ПолучитьКартинкуТабличногоДокумента(ТабличныйДокумент, ИмяКартинки);
		Рисунок.Расположить(ТабличныйДокумент.ТекущаяОбласть);
		
		CW_ШаблоныДокументовКлиент.УстановитьРазмерыКартинкиXML(Рисунок, ИмяКартинки);
		УстановитьВидимостьМасштаба(Истина);
	Иначе
		ТабличныйДокумент.ТекущаяОбласть.Текст		= ТабличныйДокумент.ТекущаяОбласть.Текст + Значение;
		ТабличныйДокумент.ТекущаяОбласть.Заполнение	= ТипЗаполненияОбластиТабличногоДокумента.Текст;
	Конецесли;
	
КонецПроцедуры    

&НаКлиенте
Процедура НазначениеШаблонаПриИзменении(Элемент)
	УстановитьОтборСпискаПараметровШаблона();
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)   
	Отказ = истина;
КонецПроцедуры  

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломИзменения(Элемент, Отказ)
		Отказ = Не РедактированиеМакросовДоступно;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПоказателейШаблона" Тогда
		УстановитьОтборСпискаПараметровШаблона();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСпискаПараметровШаблона() 
	
	ПараметрыШаблона.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = ПараметрыШаблона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= Объект.НазначениеШаблона;
	НовыйЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортМакета(Команда) 
	
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогДляСохраненияМакетаЗавершение", ЭтотОбъект);
	ДиалогВыбораПапки.Показать(ОписаниеОповещения);   
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляСохраненияМакетаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда
		КаталогДляСохранения 		= ВыбранныеФайлы.Получить(0);    
		
		ОписаниеФайла 	= ПоместитьФайлыВоВременноеХранилищеНаСервере(); 
		
		#Если ВебКлиент Тогда
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			
			НачатьПолучениеФайлаССервера(ОписаниеФайла.АдресВоВременномХранилище, ОписаниеФайла.Представление, ПараметрыДиалогаПолученияФайлов);
		#Иначе 
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("КаталогДляСохранения", КаталогДляСохранения);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохранения);
			
			ПолучаемыеФайлы = Новый Массив;
			
			ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
			ПолучаемыйФайл.Имя 		= ОписаниеФайла.Представление;
			ПолучаемыйФайл.Хранение = ОписаниеФайла.АдресВоВременномХранилище;
			
			ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
			
			НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.MXL);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции  

&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере()
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	// Указываем имя файла вложения
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(Объект.Наименование));
	
	ИмяФайла = ИмяФайлаБезРасширения + ".mxl";
	// Подготовим PDF документ на основе табличного документа
	ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(Папка, ИмяФайла);
	
	ДвоичныеДанные 				= Новый ДвоичныеДанные(ПолноеИмяФайла);
	ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);   
	
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Представление", ИмяФайла);
	ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат ОписаниеФайла;
	
КонецФункции

 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции

&НаКлиенте
Процедура ИмпортМакета(Команда)
	
	ПараметрыДиалога	= Новый ПараметрыДиалогаПомещенияФайлов("Выберите макета", Ложь, "Табличный документ|*.mxl"); 
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗавершитьПомещениеФайла", ЭтотОбъект);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,, ПараметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьПомещениеФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьПомещениеФайланаСервере(ОписаниеПомещенногоФайла.Адрес);
	
КонецПроцедуры    

&НаСервере
Процедура ЗавершитьПомещениеФайланаСервере(АдресФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДанныеФайла.Записать(ИмяВременногоФайла);  
	
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла);  
	
	УдалитьВременныйФайлНаСервер(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)

	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ПараметрыПеретаскивания.Значение) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ПараметрыПеретаскивания.Значение); 
 	ПараметрыПеретаскивания.Значение = ИдентификаторПараметра;

КонецПроцедуры

&НаКлиенте
Процедура МасштабПечатиПриИзменении(Элемент) 
	
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации", ИсходныеПечатьШиринаВысота, Объект.МасштабПечати);
	
КонецПроцедуры   

&НаКлиенте
Процедура МасштабПечатиОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	Объект.МасштабПечати = 100;
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации", ИсходныеПечатьШиринаВысота, Объект.МасштабПечати);     

КонецПроцедуры


&НаКлиенте
Процедура МасштабПодписиПриИзменении(Элемент)
	
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "РуководительПодпись", ИсходныеПодписьШиринаВысота, Объект.МасштабПодписи);
	
КонецПроцедуры    

&НаКлиенте
Процедура МасштабПодписиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Объект.МасштабПодписи = 100;
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "РуководительПодпись", ИсходныеПодписьШиринаВысота, Объект.МасштабПодписи); 

КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)

	Модифицированность 		= истина;
	ЕстьПодписьИлиПечать 	= ПровериьНаличиеПодписиИлиПечать();
	УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать);

КонецПроцедуры

//Настройки колонтитулов
&НаКлиенте
Процедура ВыводитьВерхнийКолонтитулПриИзменении(Элемент)

	УстановитьВидимостьНастроекКолонтитула(); 
	
	Если НЕ Объект.ВыводитьКолонтитулы тогда
		СброситьКолонтитулыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНастроекКолонтитула()
	
	Элементы.ОткрытьНастройкиКолонтитулов.Видимость =  Объект.ВыводитьКолонтитулы;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКолонтитулов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьНастройкуКолонтитулов", ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура;  
	Если ЭтоАдресВременногоХранилища(АдресНастроекКолонтитулов) Тогда
		Настройки = ПолучитьИзВременногоХранилища(АдресНастроекКолонтитулов);
	КонецЕсли;
	СтруктураПараметров.Вставить("Настройки", Настройки);
	
	ОткрытьФорму("ОбщаяФорма.НастройкаКолонтитулов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	
КонецПроцедуры       

&НаКлиенте
Процедура ЗавершитьНастройкуКолонтитулов(Настройки, ДополнитлеьныеПараметры) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	АдресНастроекКолонтитулов 	= ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);

	СброситьКолонтитулыНаСервере();
	УстановитьКолонтитулыНаСервере(Настройки);

	Модифицированность 			= Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКолонтитулыНаСервере(СвойстваКолонтитулов)
	
	Если Не КолонтитулУстановлен(СвойстваКолонтитулов.ВерхнийКолонтитул)
		И Не КолонтитулУстановлен(СвойстваКолонтитулов.НижнийКолонтитул) Тогда
		Возврат;
	КонецЕсли;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(ТабличныйДокумент,,,СвойстваКолонтитулов);
	//УправлениеКолонтитулами                                                
	

КонецПроцедуры 

&НаСервере
Функция КолонтитулУстановлен(Колонтитул)
	Возврат ЗначениеЗаполнено(Колонтитул.ТекстСлева)
		Или ЗначениеЗаполнено(Колонтитул.ТекстВЦентре)
		Или ЗначениеЗаполнено(Колонтитул.ТекстСправа);
КонецФункции

	
&НаСервере
Процедура СброситьКолонтитулыНаСервере()
	
	СброситьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
	СброситьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);

КонецПроцедуры

&НаСервере
Процедура СброситьКолонтитул(Колонтитул) 

	Колонтитул.ТекстСлева = "";
	Колонтитул.ТекстВЦентре = "";
	Колонтитул.ТекстСправа = "";

КонецПроцедуры  
//Настройки колонтитулов
